### 멀티 인덱스 데이터 프레임

In [1]:
import pandas as pd
import numpy as np
import os

#### 신규 생성:

In [2]:
my_header = ['a','b','c']

In [3]:
my_index_out = ['G1']*3 + ['G2']*3
my_index_in = [1,2,3]*2

In [4]:
my_index_zipped = list(zip(my_index_out, my_index_in))
my_index_zipped

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [5]:
my_index = pd.MultiIndex.from_tuples(my_index_zipped)
my_index.names = ["big", "small"]
my_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           names=['big', 'small'])

In [6]:
df = pd.DataFrame(data=np.random.randn(6,3),index=my_index,columns=my_header)
df

                  a         b         c
big small
G1  1      0.180482  0.012485  0.536000
    2      1.414812  1.627919 -0.818188
    3     -0.096531 -0.725354  0.111193
G2  1      0.557175 -1.166657  0.636568
    2      0.178624  1.762736  0.452222
    3     -0.092281  0.127173 -2.423871

#### 슬라이싱:

In [7]:
df.loc['G1']

              a         b         c
small
1      0.180482  0.012485  0.536000
2      1.414812  1.627919 -0.818188
3     -0.096531 -0.725354  0.111193

In [8]:
df.loc['G1'].loc[1]

a    0.180482
b    0.012485
c    0.536000
Name: 1, dtype: float64

In [9]:
df.loc['G1'].loc[1,'b']

0.012484744025075092

### 그룹연산

In [46]:
df = pd.read_csv('./data/data_studentlist_en.csv',header='infer',encoding = 'latin1')

In [47]:
df.head(3)

             name gender  age  grade absence bloodtype  height  weight
0   Jared Diamond      M   23      3       Y         O   165.3    68.2
1  Sarah O'Donnel      F   22      2       N        AB   170.1    53.0
2    Brian Martin      M   24      4       N         B   175.0    80.1

In [48]:
df.groupby('gender').mean()

              age     grade      height     weight
gender
F       21.857143  1.714286  166.642857  50.442857
M       22.700000  2.700000  172.410000  68.500000

In [49]:
df.groupby('gender')['height'].mean()

gender
F    166.642857
M    172.410000
Name: height, dtype: float64

In [50]:
df.groupby('gender')[['height','weight']].mean()

            height     weight
gender
F       166.642857  50.442857
M       172.410000  68.500000

In [51]:
df.groupby('gender')[['grade','age']].std()

           grade       age
gender
F       0.755929  1.069045
M       1.159502  1.159502

In [52]:
df.groupby('gender')['height'].describe()

        count        mean       std    min      25%    50%    75%    max
gender
F         7.0  166.642857  8.487414  155.2  160.100  168.0  173.1  176.9
M        10.0  172.410000  6.804647  162.2  167.475  172.1  177.9  182.1

In [53]:
sr = df.groupby(['gender','bloodtype'])['height'].mean()     # 멀티 인덱싱!!
sr

gender  bloodtype
F       A            172.450000
        AB           170.100000
        B            158.200000
        O            164.433333
M       A            165.700000
        AB           181.050000
        B            174.550000
        O            166.200000
Name: height, dtype: float64

In [54]:
# 멀티 인덱스 확인.
sr.index

MultiIndex([('F',  'A'),
            ('F', 'AB'),
            ('F',  'B'),
            ('F',  'O'),
            ('M',  'A'),
            ('M', 'AB'),
            ('M',  'B'),
            ('M',  'O')],
           names=['gender', 'bloodtype'])

In [55]:
sr.loc['F']

bloodtype
A     172.450000
AB    170.100000
B     158.200000
O     164.433333
Name: height, dtype: float64

In [56]:
sr['F']

bloodtype
A     172.450000
AB    170.100000
B     158.200000
O     164.433333
Name: height, dtype: float64

In [57]:
sr.loc['F'].loc['A']

172.45

In [58]:
sr['F']['A']

172.45

### apply 함수, sort_values 함수, 등.

In [59]:
df['height'].apply(lambda x: x/100)

0     1.653
1     1.701
2     1.750
3     1.821
4     1.680
5     1.620
6     1.552
7     1.769
8     1.785
9     1.761
10    1.671
11    1.800
12    1.622
13    1.761
14    1.582
15    1.686
16    1.692
Name: height, dtype: float64

In [60]:
df.sort_values(by='bloodtype')

                name gender  age  grade absence bloodtype  height  weight
16      Andrew Daley      M   21      1       N         A   169.2    62.2
4    Clara Rodriquez      F   20      1       Y         A   168.0    49.5
12      Eddy Johnson      M   21      1       N         A   162.2    55.3
7    Margareth Jones      F   23      1       N         A   176.9    55.0
1     Sarah O'Donnel      F   22      2       N        AB   170.1    53.0
3       David Hassel      M   23      3       N        AB   182.1    85.7
11      John Matsuda      M   22      2       N        AB   180.0    75.8
14      Linda Carter      F   22      2       N         B   158.2    45.2
9     Jake Timmerman      M   22      2       N         B   176.1    61.3
8       John Bertsch      M   23      3       N         B   178.5    64.2
2       Brian Martin      M   24      4       N         B   175.0    80.1
15    Richard Swayze      M   24      4       Y         B   168.6    70.2
10     Joshua Connor      M   24      4       Y         O   167.1    62.0
6        Susan Clark      F   22      1       N         O   155.2    45.3
5   Jennifer Lorentz      F   21      2       N         O   162.0    52.0
13  Rebecah Anderson      F   23      3       N         O   176.1    53.1
0      Jared Diamond      M   23      3       Y         O   165.3    68.2

In [61]:
df.sort_values(by='bloodtype', ascending=False)

                name gender  age  grade absence bloodtype  height  weight
0      Jared Diamond      M   23      3       Y         O   165.3    68.2
13  Rebecah Anderson      F   23      3       N         O   176.1    53.1
5   Jennifer Lorentz      F   21      2       N         O   162.0    52.0
6        Susan Clark      F   22      1       N         O   155.2    45.3
10     Joshua Connor      M   24      4       Y         O   167.1    62.0
9     Jake Timmerman      M   22      2       N         B   176.1    61.3
15    Richard Swayze      M   24      4       Y         B   168.6    70.2
14      Linda Carter      F   22      2       N         B   158.2    45.2
8       John Bertsch      M   23      3       N         B   178.5    64.2
2       Brian Martin      M   24      4       N         B   175.0    80.1
1     Sarah O'Donnel      F   22      2       N        AB   170.1    53.0
11      John Matsuda      M   22      2       N        AB   180.0    75.8
3       David Hassel      M   23      3       N        AB   182.1    85.7
7    Margareth Jones      F   23      1       N         A   176.9    55.0
12      Eddy Johnson      M   21      1       N         A   162.2    55.3
4    Clara Rodriquez      F   20      1       Y         A   168.0    49.5
16      Andrew Daley      M   21      1       N         A   169.2    62.2

In [62]:
df.sort_values(by=['bloodtype','gender'])

                name gender  age  grade absence bloodtype  height  weight
4    Clara Rodriquez      F   20      1       Y         A   168.0    49.5
7    Margareth Jones      F   23      1       N         A   176.9    55.0
12      Eddy Johnson      M   21      1       N         A   162.2    55.3
16      Andrew Daley      M   21      1       N         A   169.2    62.2
1     Sarah O'Donnel      F   22      2       N        AB   170.1    53.0
3       David Hassel      M   23      3       N        AB   182.1    85.7
11      John Matsuda      M   22      2       N        AB   180.0    75.8
14      Linda Carter      F   22      2       N         B   158.2    45.2
2       Brian Martin      M   24      4       N         B   175.0    80.1
8       John Bertsch      M   23      3       N         B   178.5    64.2
9     Jake Timmerman      M   22      2       N         B   176.1    61.3
15    Richard Swayze      M   24      4       Y         B   168.6    70.2
5   Jennifer Lorentz      F   21      2       N         O   162.0    52.0
6        Susan Clark      F   22      1       N         O   155.2    45.3
13  Rebecah Anderson      F   23      3       N         O   176.1    53.1
0      Jared Diamond      M   23      3       Y         O   165.3    68.2
10     Joshua Connor      M   24      4       Y         O   167.1    62.0

In [63]:
df['bloodtype'].unique()

array(['O', 'AB', 'B', 'A'], dtype=object)

In [64]:
df['bloodtype'].nunique()

4

In [65]:
#도수분포표
df['bloodtype'].value_counts()

B     5
O     5
A     4
AB    3
Name: bloodtype, dtype: int64

In [66]:
#도수분포표
df['gender'].value_counts()

M    10
F     7
Name: gender, dtype: int64

### 피보팅

In [67]:
df = pd.DataFrame({"A": ["foo", "foo", "foo", "foo", "foo",
                          "bar", "bar", "bar", "bar"],
                    "B": ["one", "one", "one", "two", "two",
                          "one", "one", "two", "two"],
                    "C": ["small", "large", "large", "small",
                          "small", "large", "small", "small",
                          "large"],
                    "D": [1, 2, 2, 3, 3, 4, 5, 6, 7],
                    "E": [2, 4, 5, 5, 6, 6, 8, 9, 9]})
df

     A    B      C  D  E
0  foo  one  small  1  2
1  foo  one  large  2  4
2  foo  one  large  2  5
3  foo  two  small  3  5
4  foo  two  small  3  6
5  bar  one  large  4  6
6  bar  one  small  5  8
7  bar  two  small  6  9
8  bar  two  large  7  9

In [68]:
# A,B의 값으로 인덱스, C의 값으로 컬럼, 실제 셀에 들어가는 값은 E의 평균.
dfr = pd.pivot_table(df, index=['A','B'], columns='C', values='E')      
dfr

C        large  small
A   B
bar one    6.0    8.0
    two    9.0    9.0
foo one    4.5    2.0
    two    NaN    5.5

In [69]:
dfr.columns

Index(['large', 'small'], dtype='object', name='C')

In [70]:
dfr.index                                                                 # 행의 인덱스가 멀티인덱스 !

MultiIndex([('bar', 'one'),
            ('bar', 'two'),
            ('foo', 'one'),
            ('foo', 'two')],
           names=['A', 'B'])

In [71]:
pd.pivot_table(df, index=['A','B'], columns='C', values='E', fill_value=0)

C        large  small
A   B
bar one    6.0    8.0
    two    9.0    9.0
foo one    4.5    2.0
    two    0.0    5.5

In [72]:
pd.pivot_table(df, index=['A','B'], columns='C', values='E', aggfunc=np.mean, fill_value=0)

C        large  small
A   B
bar one    6.0    8.0
    two    9.0    9.0
foo one    4.5    2.0
    two    0.0    5.5

In [73]:
# C의 값으로 인덱스, A, B의 값으로 컬럼, 실제 셀에 들어가는 값은 E의 평균.
dfr = pd.pivot_table(df, index='C', columns=['A','B'], values='E')
dfr

A      bar       foo
B      one  two  one  two
C
large  6.0  9.0  4.5  NaN
small  8.0  9.0  2.0  5.5

In [74]:
dfr.index

Index(['large', 'small'], dtype='object', name='C')

In [75]:
dfr.columns                                                           # 이제는 컬럼이 멀티인덱스 !

MultiIndex([('bar', 'one'),
            ('bar', 'two'),
            ('foo', 'one'),
            ('foo', 'two')],
           names=['A', 'B'])

In [76]:
# A,B의 값으로 인덱스, C의 값으로 컬럼, 실제 셀에 들어가는 값은 E의 중양값.
pd.pivot_table(df, index=['A','B'], columns='C', values='E', aggfunc=np.median,fill_value=0)

C        large  small
A   B
bar one    6.0    8.0
    two    9.0    9.0
foo one    4.5    2.0
    two    0.0    5.5

In [77]:
pd.pivot_table(df, index=['A','B'], columns='C', values='E', aggfunc=np.sum, fill_value=0)

C        large  small
A   B
bar one      6      8
    two      9      9
foo one      9      2
    two      0     11

In [78]:
# D와 E의 그룹평균.
pd.pivot_table(df, index=['A','B'], values=['D','E'], aggfunc=np.mean)

                D         E
A   B
bar one  4.500000  7.000000
    two  6.500000  9.000000
foo one  1.666667  3.666667
    two  3.000000  5.500000

In [79]:
# 위 결과와 비교.
df.groupby(['A','B'])[['D','E']].mean()

                D         E
A   B
bar one  4.500000  7.000000
    two  6.500000  9.000000
foo one  1.666667  3.666667
    two  3.000000  5.500000

In [80]:
# D, E를 다른 방법으로 집계함.
pd.pivot_table(df, index=['A','B'], values=['D','E'], aggfunc={'D':np.mean,'E':np.median})

                D    E
A   B
bar one  4.500000  7.0
    two  6.500000  9.0
foo one  1.666667  4.0
    two  3.000000  5.5